000100190625      *
000200190625     DARRAY1           S              3P 0 dim(5)
000300190625     DCount            S              2P 0 inz(1)
000400190624
000500190702     C                   DOU       COUNT > 5
000600190625      *
000700190701     C                   EVAL      ARRAY1(COUNT) = COUNT
000800190625     C     ARRAY1(COUNT) DSPLY
000900190702     C                   EVAL      COUNT = COUNT + 1
001000190624     C                   ENDDO
001100190624      *
001200190701     C                   EVAL      *INLR = *ON
001300190624      *
001400190624      *
001500000000      //***************************************************************
